codeigniter/app/Helpers/SupportFunct_helper.php

function checkEmailverified($model, $userid)
{
    // only called in this controller not through route
    $userModel = $model;
    $tocheck = $userModel->find($userid);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'