codeigniter/app/Controllers/PersonalInfoController.php

SELECT *
FROM `user_info`
WHERE `user_id` = '1'
 LIMIT 1
UPDATE `user_info` SET `location_country` = '1', `location_state` = '45', `location_city` = '5922', `occupation` = 'ADVERTISING, MEDIA & ENTERTAINMENT|6', `hobbies` = 'hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh'
WHERE `user_info`.`id` IN ('1')
---
        $session->set($sessiondata);

        $userInfomodel = new UserInfo();
        $userinfoRow = $userInfomodel->where('user_id', $userid)->first();

        // echo $userinfoRow['dob'];

        $userInfomodel->update($userinfoRow['id'], $sessiondata);

SELECT *
FROM `user_info`
WHERE `user_id` = '1'
 LIMIT 1
UPDATE `user_info` SET `about_me` = '', `whatsapp_number` = '9879879875', `baptized` = ''
WHERE `user_info`.`id` IN ('1')
---
        $session->set($sessiondata);

        $userInfomodel = new UserInfo();
        $userinfoRow = $userInfomodel->where('user_id', $userid)->first();

        // echo $userinfoRow['dob'];

        $userInfomodel->update($userinfoRow['id'], $sessiondata);