codeigniter/app/Controllers/UserHome.php

    public function index()
    {
        $pageData = ['title' => 'User Dashboard'];

        $useremail = $_SESSION['userEmail'];
        $user_model = new User();
        $userInfo_model = new UserInfo();
        $userphoto_model = new UserPhoto();

        $getUserRow = $user_model->where('email', $useremail)->first();
        $getUserphotos =  $userphoto_model->where('user_id', $getUserRow['id'])->findAll();
        $getUserInfo = $userInfo_model->where('user_id', $getUserRow['id'])->first();
---
SELECT *
FROM `user`
WHERE `email` = 'airindustry3@gmail.com'
 LIMIT 1
SELECT *
FROM `user_photo`
WHERE `user_id` = '1'
SELECT *
FROM `user_info`
WHERE `user_id` = '1'
 LIMIT 1

    public function editPartnerPreference() {
        $pageData = ['title' => 'Your Partner Preference'];
        $data['language'] = language();
        $data['countries'] = getCountries();


        $partnerPref = new PartnerPreference();
        $usermodel = new User();

        $userrow = $usermodel->where('email', $_SESSION['userEmail'])->first();

        $partnerprof = $partnerPref->where('user_id', $userrow['id'])->first();
---
SELECT *
FROM `user`
WHERE `email` = 'airindustry3@gmail.com'
 LIMIT 1
SELECT *
FROM `partner_preference`
WHERE `user_id` = '1'
 LIMIT 1